drop database if exists midTermDB;

create database if not exists midTermDB;

use midTermDB;
-- select database();

-- ########################## 類別總表 ##########################
create table CommonType (
    commontype_id INT PRIMARY KEY AUTO_INCREMENT,
    code_type INT,
    code_type_desc VARCHAR(50),
    code_id INT,
    code_desc VARCHAR(200),
    code_remark INT
);

-- 插入共同類別表格的資料為:
INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (1, '縣市別', 1, '宜蘭縣', NULL),
    (1, '縣市別', 2, '台北市', NULL),
    (1, '縣市別', 3, '新北市', NULL),
    (1, '縣市別', 4, '基隆市', NULL),
    (1, '縣市別', 5, '桃園縣', NULL),
    (1, '縣市別', 6, '新竹市', NULL),
    (1, '縣市別', 7, '新竹縣', NULL),
    (1, '縣市別', 8, '苗栗縣', NULL),
    (1, '縣市別', 9, '台中市', NULL),
    (1, '縣市別', 10, '彰化縣', NULL),
    (1, '縣市別', 11, '南投縣', NULL),
    (1, '縣市別', 12, '雲林縣', NULL),
    (1, '縣市別', 13, '嘉義市', NULL),
    (1, '縣市別', 14, '嘉義縣', NULL),
    (1, '縣市別', 15, '台南市', NULL),
    (1, '縣市別', 16, '高雄市', NULL),
    (1, '縣市別', 17, '屏東縣', NULL),
    (1, '縣市別', 18, '台東縣', NULL),
    (1, '縣市別', 19, '花蓮縣', NULL),
    (1, '縣市別', 20, '澎湖縣', NULL),
    (1, '縣市別', 21, '金門縣', NULL),
    (1, '縣市別', 22, '連江縣', NULL),
    (2, '地區別', 1, '中正區', 2),
    (2, '地區別', 2, '文山區', 2),
    (2, '地區別', 3, '萬華區', 2),
    (2, '地區別', 4, '大同區', 2),
    (2, '地區別', 5, '中山區', 2),
    (2, '地區別', 6, '內湖區', 2),
    (2, '地區別', 7, '松山區', 2),
    (2, '地區別', 8, '南港區', 2),
    (2, '地區別', 9, '信義區', 2),
    (2, '地區別', 10, '士林區', 2),
    (2, '地區別', 11, '北投區', 2),
    (2, '地區別', 12, '大安區', 2),
    (3, '場管類別', 1, '健身房', NULL),
    (3, '場管類別', 2, '心肺耐力', NULL),
    (3, '場管類別', 3, '瑜珈會館', NULL),
    (3, '場管類別', 4, '游泳池', NULL),
    (3, '場管類別', 5, '放鬆舒緩', NULL),
    (3, '場管類別', 6, '平衡運動', NULL),
    (4, '課程類型', 1, '伸展', NULL),
    (4, '課程類型', 2, '心肺', NULL),
    (4, '課程類型', 3, '游泳', NULL),
    (4, '課程類型', 4, '增肌', NULL),
    (5, '廠商', 1, '星星', NULL),
    (5, '廠商', 2, '晨星', NULL),
    (5, '廠商', 3, '喵喵', NULL),
    (5, '廠商', 4, '成吉', NULL),
    (5, '廠商', 5, '萵苣', NULL),
    (6, '商品類別', 1, '居家訓練', NULL),
    (6, '商品類別', 2, '運動服飾', NULL),
    (6, '商品類別', 3, '健身護具', NULL),
    (6, '商品類別', 4, '健康食品', NULL),
    (7, '商品子類別', 1, '護膝', 3),
    (7, '商品子類別', 2, '護腿', 3),
    (7, '商品子類別', 3, '護踝', 3),
    (7, '商品子類別', 4, '護腰', 3),
    (8, '常見問題分類', 1, '商城', NULL),
    (8, '常見問題分類', 2, '課程', NULL),
    (8, '常見問題分類', 3, '地圖', NULL),
    (9, '文章主類別', 1, '體能鍛鍊', NULL),
    (9, '文章主類別', 2, '健康飲食', NULL),
    (9, '文章主類別', 3, '醫療保健', NULL),
    (9, '文章主類別', 4, '心靈健康', NULL),
    (9, '文章主類別', 5, '熟齡學習', NULL),
    (10, '關鍵字', 1, '自我成長', NULL),
    (10, '關鍵字', 2, '人際關係', NULL),
    (10, '關鍵字', 3, '兩性家庭', NULL),
    (10, '關鍵字', 4, '醫療保健', NULL),
    (10, '關鍵字', 5, '飲食', NULL),
    (10, '關鍵字', 6, '運動', NULL),
    (10, '關鍵字', 7, '熟齡學習', NULL),
    (10, '關鍵字', 8, '美妝保養', NULL),
    (10, '關鍵字', 9, '日常穿搭', NULL),
    (10, '關鍵字', 10, '職場就業', NULL),
    (10, '關鍵字', 11, '熟年法律', NULL),
    (10, '關鍵字', 12, '退休理財', NULL),
    (10, '關鍵字', 13, '抗老', NULL),
    (10, '關鍵字', 14, '逆齡', NULL),
    (10, '關鍵字', 15, '第三人生', NULL),
    (10, '關鍵字', 16, '婚姻', NULL),
    (10, '關鍵字', 17, '家庭關係', NULL),
    (10, '關鍵字', 18, '退休生活', NULL),
    (10, '關鍵字', 19, '主題旅行', NULL),
    (10, '關鍵字', 20, '圓夢', NULL),
    (
        11,
        '留言回報類別',
        1,
        'profanity filter',
        NULL
    ),
    (
        11,
        '留言回報類別',
        2,
        '使用不當語言',
        NULL
    ),
    (11, '留言回報類別', 3, '包含廣告', NULL),
    (11, '留言回報類別', 4, '帶有歧視', NULL),
    (12, '敏感詞分類', 1, '廣告', NULL),
    (12, '敏感詞分類', 2, '色情', NULL),
    (12, '敏感詞分類', 3, '暴力', NULL),
    (12, '敏感詞分類', 4, '其他', NULL),
    (4, '課程類型', 5, '肌耐力', NULL),
    (4, '課程類型', 6, '柔軟度', NULL),
    (4, '課程類型', 7, '健美', NULL),
    (4, '課程類型', 8, '徒手訓練', NULL),
    (14, '上架狀態', 0, '未上架', NULL),
    (14, '上架狀態', 1, '已上架', NULL);

-- 0515 新增 鄉鎮市入CommonType
INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '宜蘭市', 1),
    (2, '地區別', 2, '壯圍鄉', 1),
    (2, '地區別', 3, '員山鄉', 1),
    (2, '地區別', 4, '礁溪鄉', 1),
    (2, '地區別', 5, '頭城鎮', 1),
    (2, '地區別', 6, '羅東鎮', 1),
    (2, '地區別', 7, '五結鄉', 1),
    (2, '地區別', 8, '三星鄉', 1),
    (2, '地區別', 9, '冬山鄉', 1),
    (2, '地區別', 10, '蘇澳鎮', 1),
    (2, '地區別', 11, '大同鄉', 1),
    (2, '地區別', 12, '南澳鄉', 1);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '三重區', 3),
    (2, '地區別', 2, '板橋區', 3),
    (2, '地區別', 3, '中和區', 3),
    (2, '地區別', 4, '永和區', 3),
    (2, '地區別', 5, '新莊區', 3),
    (2, '地區別', 6, '土城區', 3),
    (2, '地區別', 7, '蘆洲區', 3),
    (2, '地區別', 8, '汐止區', 3),
    (2, '地區別', 9, '樹林區', 3),
    (2, '地區別', 10, '鶯歌區', 3),
    (2, '地區別', 11, '三峽區', 3),
    (2, '地區別', 12, '淡水區', 3),
    (2, '地區別', 13, '新店區', 3),
    (2, '地區別', 14, '深坑區', 3),
    (2, '地區別', 15, '石碇區', 3),
    (2, '地區別', 16, '坪林區', 3),
    (2, '地區別', 17, '烏來區', 3),
    (2, '地區別', 18, '瑞芳區', 3),
    (2, '地區別', 19, '貢寮區', 3),
    (2, '地區別', 20, '雙溪區', 3),
    (2, '地區別', 21, '平溪區', 3),
    (2, '地區別', 22, '五股區', 3),
    (2, '地區別', 23, '八里區', 3),
    (2, '地區別', 24, '林口區', 3),
    (2, '地區別', 25, '金山區', 3),
    (2, '地區別', 26, '萬里區', 3),
    (2, '地區別', 27, '三芝區', 3),
    (2, '地區別', 28, '石門區', 3),
    (2, '地區別', 29, '泰山區', 3);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '仁愛區', 4),
    (2, '地區別', 2, '中正區', 4),
    (2, '地區別', 3, '信義區', 4),
    (2, '地區別', 4, '中山區', 4),
    (2, '地區別', 5, '安樂區', 4),
    (2, '地區別', 6, '七堵區', 4),
    (2, '地區別', 7, '暖暖區', 4);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '桃園區', 5),
    (2, '地區別', 2, '中壢區', 5),
    (2, '地區別', 3, '平鎮區', 5),
    (2, '地區別', 4, '八德區', 5),
    (2, '地區別', 5, '楊梅區', 5),
    (2, '地區別', 6, '蘆竹區', 5),
    (2, '地區別', 7, '大溪區', 5),
    (2, '地區別', 8, '龜山區', 5),
    (2, '地區別', 9, '大園區', 5),
    (2, '地區別', 10, '觀音區', 5),
    (2, '地區別', 11, '新屋區', 5),
    (2, '地區別', 12, '龍潭區', 5),
    (2, '地區別', 13, '復興區', 5);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '東區', 6),
    (2, '地區別', 2, '北區', 6),
    (2, '地區別', 3, '香山區', 6),
    (2, '地區別', 4, '新竹市', 6);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '竹北市', 7),
    (2, '地區別', 2, '竹東鎮', 7),
    (2, '地區別', 3, '新埔鎮', 7),
    (2, '地區別', 4, '關西鎮', 7),
    (2, '地區別', 5, '新豐鄉', 7),
    (2, '地區別', 6, '峨眉鄉', 7),
    (2, '地區別', 7, '寶山鄉', 7),
    (2, '地區別', 8, '五峰鄉', 7),
    (2, '地區別', 9, '橫山鄉', 7),
    (2, '地區別', 10, '北埔鄉', 7),
    (2, '地區別', 11, '尖石鄉', 7),
    (2, '地區別', 12, '芎林鄉', 7),
    (2, '地區別', 13, '湖口鄉', 7);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '苗栗市', 8),
    (2, '地區別', 2, '竹南鎮', 8),
    (2, '地區別', 3, '頭份市', 8),
    (2, '地區別', 4, '後龍鎮', 8),
    (2, '地區別', 5, '通霄鎮', 8),
    (2, '地區別', 6, '苑裡鎮', 8),
    (2, '地區別', 7, '卓蘭鎮', 8),
    (2, '地區別', 8, '三灣鄉', 8),
    (2, '地區別', 9, '南庄鄉', 8),
    (2, '地區別', 10, '造橋鄉', 8),
    (2, '地區別', 11, '獅潭鄉', 8),
    (2, '地區別', 12, '頭屋鄉', 8),
    (2, '地區別', 13, '西湖鄉', 8),
    (2, '地區別', 14, '公館鄉', 8),
    (2, '地區別', 15, '銅鑼鄉', 8),
    (2, '地區別', 16, '泰安鄉', 8),
    (2, '地區別', 17, '大湖鄉', 8),
    (2, '地區別', 18, '三義鄉', 8);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '中區', 9),
    (2, '地區別', 2, '東區', 9),
    (2, '地區別', 3, '西區', 9),
    (2, '地區別', 4, '南區', 9),
    (2, '地區別', 5, '北區', 9),
    (2, '地區別', 6, '西屯區', 9),
    (2, '地區別', 7, '南屯區', 9),
    (2, '地區別', 8, '北屯區', 9),
    (2, '地區別', 9, '豐原區', 9),
    (2, '地區別', 10, '大里區', 9),
    (2, '地區別', 11, '太平區', 9),
    (2, '地區別', 12, '東勢區', 9),
    (2, '地區別', 13, '沙鹿區', 9),
    (2, '地區別', 14, '梧棲區', 9),
    (2, '地區別', 15, '清水區', 9),
    (2, '地區別', 16, '大甲區', 9),
    (2, '地區別', 17, '霧峰區', 9),
    (2, '地區別', 18, '烏日區', 9),
    (2, '地區別', 19, '后里區', 9),
    (2, '地區別', 20, '石岡區', 9),
    (2, '地區別', 21, '新社區', 9),
    (2, '地區別', 22, '潭子區', 9),
    (2, '地區別', 23, '大雅區', 9),
    (2, '地區別', 24, '神岡區', 9),
    (2, '地區別', 25, '大肚區', 9),
    (2, '地區別', 26, '龍井區', 9),
    (2, '地區別', 27, '大安區', 9),
    (2, '地區別', 28, '和平區', 9),
    (2, '地區別', 29, '外埔區', 9);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '彰化市', 10),
    (2, '地區別', 2, '員林巿', 10),
    (2, '地區別', 3, '鹿港鎮', 10),
    (2, '地區別', 4, '和美鎮', 10),
    (2, '地區別', 5, '北斗鎮', 10),
    (2, '地區別', 6, '溪湖鎮', 10),
    (2, '地區別', 7, '田中鎮', 10),
    (2, '地區別', 8, '二林鎮', 10),
    (2, '地區別', 9, '線西鄉', 10),
    (2, '地區別', 10, '伸港鄉', 10),
    (2, '地區別', 11, '福興鄉', 10),
    (2, '地區別', 12, '秀水鄉', 10),
    (2, '地區別', 13, '花壇鄉', 10),
    (2, '地區別', 14, '芬園鄉', 10),
    (2, '地區別', 15, '大村鄉', 10),
    (2, '地區別', 16, '埔鹽鄉', 10),
    (2, '地區別', 17, '埔心鄉', 10),
    (2, '地區別', 18, '永靖鄉', 10),
    (2, '地區別', 19, '社頭鄉', 10),
    (2, '地區別', 20, '二水鄉', 10),
    (2, '地區別', 21, '田尾鄉', 10),
    (2, '地區別', 22, '埤頭鄉', 10),
    (2, '地區別', 23, '芳苑鄉', 10),
    (2, '地區別', 24, '大城鄉', 10),
    (2, '地區別', 25, '竹塘鄉', 10),
    (2, '地區別', 26, '溪州鄉', 10);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '南投市', 11),
    (2, '地區別', 2, '埔里鎮', 11),
    (2, '地區別', 3, '草屯鎮', 11),
    (2, '地區別', 4, '竹山鎮', 11),
    (2, '地區別', 5, '集集鎮', 11),
    (2, '地區別', 6, '名間鄉', 11),
    (2, '地區別', 7, '中寮鄉', 11),
    (2, '地區別', 8, '鹿谷鄉', 11),
    (2, '地區別', 9, '水里鄉', 11),
    (2, '地區別', 10, '魚池鄉', 11),
    (2, '地區別', 11, '國姓鄉', 11),
    (2, '地區別', 12, '信義鄉', 11),
    (2, '地區別', 13, '仁愛鄉', 11);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '麥寮鄉', 12),
    (2, '地區別', 2, '崙背鄉', 12),
    (2, '地區別', 3, '二崙鄉', 12),
    (2, '地區別', 4, '西螺鎮', 12),
    (2, '地區別', 5, '莿桐鄉', 12),
    (2, '地區別', 6, '林內鄉', 12),
    (2, '地區別', 7, '臺西鄉', 12),
    (2, '地區別', 8, '東勢鄉', 12),
    (2, '地區別', 9, '褒忠鄉', 12),
    (2, '地區別', 10, '元長鄉', 12),
    (2, '地區別', 11, '土庫鎮', 12),
    (2, '地區別', 12, '大埤鄉', 12),
    (2, '地區別', 13, '虎尾鎮', 12),
    (2, '地區別', 14, '斗六市', 12),
    (2, '地區別', 15, '斗南鎮', 12),
    (2, '地區別', 16, '古坑鄉', 12),
    (2, '地區別', 17, '四湖鄉', 12),
    (2, '地區別', 18, '口湖鄉', 12),
    (2, '地區別', 19, '水林鄉', 12),
    (2, '地區別', 20, '北港鎮', 12);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '東區', 13),
    (2, '地區別', 2, '西區', 13);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '太保市', 14),
    (2, '地區別', 2, '朴子市', 14),
    (2, '地區別', 3, '布袋鎮', 14),
    (2, '地區別', 4, '大林鎮', 14),
    (2, '地區別', 5, '民雄鄉', 14),
    (2, '地區別', 6, '溪口鄉', 14),
    (2, '地區別', 7, '六腳鄉', 14),
    (2, '地區別', 8, '東石鄉', 14),
    (2, '地區別', 9, '義竹鄉', 14),
    (2, '地區別', 10, '鹿草鄉', 14),
    (2, '地區別', 11, '水上鄉', 14),
    (2, '地區別', 12, '中埔鄉', 14),
    (2, '地區別', 13, '竹崎鄉', 14),
    (2, '地區別', 14, '梅山鄉', 14),
    (2, '地區別', 15, '番路鄉', 14),
    (2, '地區別', 16, '大埔鄉', 14),
    (2, '地區別', 17, '新港鄉', 14),
    (2, '地區別', 18, '阿里山鄉', 14);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '新營區', 15),
    (2, '地區別', 2, '鹽水區', 15),
    (2, '地區別', 3, '白河區', 15),
    (2, '地區別', 4, '柳營區', 15),
    (2, '地區別', 5, '後壁區', 15),
    (2, '地區別', 6, '東山區', 15),
    (2, '地區別', 7, '麻豆區', 15),
    (2, '地區別', 8, '下營區', 15),
    (2, '地區別', 9, '六甲區', 15),
    (2, '地區別', 10, '官田區', 15),
    (2, '地區別', 11, '大內區', 15),
    (2, '地區別', 12, '佳里區', 15),
    (2, '地區別', 13, '學甲區', 15),
    (2, '地區別', 14, '西港區', 15),
    (2, '地區別', 15, '七股區', 15),
    (2, '地區別', 16, '將軍區', 15),
    (2, '地區別', 17, '北門區', 15),
    (2, '地區別', 18, '新化區', 15),
    (2, '地區別', 19, '新市區', 15),
    (2, '地區別', 20, '善化區', 15),
    (2, '地區別', 21, '安定區', 15),
    (2, '地區別', 22, '山上區', 15),
    (2, '地區別', 23, '玉井區', 15),
    (2, '地區別', 24, '楠西區', 15),
    (2, '地區別', 25, '南化區', 15),
    (2, '地區別', 26, '左鎮區', 15),
    (2, '地區別', 27, '仁德區', 15),
    (2, '地區別', 28, '歸仁區', 15),
    (2, '地區別', 29, '關廟區', 15),
    (2, '地區別', 30, '龍崎區', 15),
    (2, '地區別', 31, '永康區', 15),
    (2, '地區別', 32, '東區', 15),
    (2, '地區別', 33, '南區', 15),
    (2, '地區別', 34, '中西區', 15),
    (2, '地區別', 35, '北區', 15),
    (2, '地區別', 36, '安南區', 15),
    (2, '地區別', 37, '安平區', 15);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '楠梓區', 16),
    (2, '地區別', 2, '左營區', 16),
    (2, '地區別', 3, '鼓山區', 16),
    (2, '地區別', 4, '三民區', 16),
    (2, '地區別', 5, '苓雅區', 16),
    (2, '地區別', 6, '新興區', 16),
    (2, '地區別', 7, '前金區', 16),
    (2, '地區別', 8, '鹽埕區', 16),
    (2, '地區別', 9, '小港區', 16),
    (2, '地區別', 10, '旗津區', 16),
    (2, '地區別', 11, '前鎮區', 16),
    (2, '地區別', 12, '鳳山區', 16),
    (2, '地區別', 13, '岡山區', 16),
    (2, '地區別', 14, '旗山區', 16),
    (2, '地區別', 15, '美濃區', 16),
    (2, '地區別', 16, '大寮區', 16),
    (2, '地區別', 17, '茄萣區', 16),
    (2, '地區別', 18, '永安區', 16),
    (2, '地區別', 19, '大社區', 16),
    (2, '地區別', 20, '杉林區', 16),
    (2, '地區別', 21, '仁武區', 16),
    (2, '地區別', 22, '田寮區', 16),
    (2, '地區別', 23, '燕巢區', 16),
    (2, '地區別', 24, '路竹區', 16),
    (2, '地區別', 25, '阿蓮區', 16),
    (2, '地區別', 26, '甲仙區', 16),
    (2, '地區別', 27, '大樹區', 16),
    (2, '地區別', 28, '湖內區', 16),
    (2, '地區別', 29, '桃源區', 16),
    (2, '地區別', 30, '鳥松區', 16),
    (2, '地區別', 31, '彌陀區', 16),
    (2, '地區別', 32, '那瑪夏區', 16),
    (2, '地區別', 33, '梓官區', 16),
    (2, '地區別', 34, '內門區', 16),
    (2, '地區別', 35, '茂林區', 16),
    (2, '地區別', 36, '橋頭區', 16),
    (2, '地區別', 37, '六龜區', 16),
    (2, '地區別', 38, '林園區', 16);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '屏東市', 17),
    (2, '地區別', 2, '潮州鎮', 17),
    (2, '地區別', 3, '東港鎮', 17),
    (2, '地區別', 4, '恆春鎮', 17),
    (2, '地區別', 5, '九如鄉', 17),
    (2, '地區別', 6, '里港鄉', 17),
    (2, '地區別', 7, '鹽埔鄉', 17),
    (2, '地區別', 8, '高樹鄉', 17),
    (2, '地區別', 9, '長治鄉', 17),
    (2, '地區別', 10, '麟洛鄉', 17),
    (2, '地區別', 11, '內埔鄉', 17),
    (2, '地區別', 12, '萬巒鄉', 17),
    (2, '地區別', 13, '竹田鄉', 17),
    (2, '地區別', 14, '萬丹鄉', 17),
    (2, '地區別', 15, '新園鄉', 17),
    (2, '地區別', 16, '崁頂鄉', 17),
    (2, '地區別', 17, '林邊鄉', 17),
    (2, '地區別', 18, '佳冬鄉', 17),
    (2, '地區別', 19, '南州鄉', 17),
    (2, '地區別', 20, '新埤鄉', 17),
    (2, '地區別', 21, '枋寮鄉', 17),
    (2, '地區別', 22, '枋山鄉', 17),
    (2, '地區別', 23, '車城鄉', 17),
    (2, '地區別', 24, '滿州鄉', 17),
    (2, '地區別', 25, '琉球鄉', 17),
    (2, '地區別', 26, '三地門鄉', 17),
    (2, '地區別', 27, '霧台鄉', 17),
    (2, '地區別', 28, '瑪家鄉', 17),
    (2, '地區別', 29, '來義鄉', 17),
    (2, '地區別', 30, '泰武鄉', 17),
    (2, '地區別', 31, '春日鄉', 17),
    (2, '地區別', 32, '獅子鄉', 17),
    (2, '地區別', 33, '牡丹鄉', 17);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '東河鄉', 18),
    (2, '地區別', 2, '成功鎮', 18),
    (2, '地區別', 3, '長濱鄉', 18),
    (2, '地區別', 4, '鹿野鄉', 18),
    (2, '地區別', 5, '關山鄉', 18),
    (2, '地區別', 6, '池上鄉', 18),
    (2, '地區別', 7, '延平鄉', 18),
    (2, '地區別', 8, '海端鄉', 18),
    (2, '地區別', 9, '台東市', 18),
    (2, '地區別', 10, '卑南鄉', 18),
    (2, '地區別', 11, '太麻里鄉', 18),
    (2, '地區別', 12, '金峰鄉', 18),
    (2, '地區別', 13, '大武鄉', 18),
    (2, '地區別', 14, '達仁鄉', 18),
    (2, '地區別', 15, '綠島鄉', 18),
    (2, '地區別', 16, '蘭嶼鄉', 18);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '花蓮市', 19),
    (2, '地區別', 2, '鳳林鎮', 19),
    (2, '地區別', 3, '玉里鎮', 19),
    (2, '地區別', 4, '新城鄉', 19),
    (2, '地區別', 5, '吉安鄉', 19),
    (2, '地區別', 6, '壽豐鄉', 19),
    (2, '地區別', 7, '光復鄉', 19),
    (2, '地區別', 8, '豐濱鄉', 19),
    (2, '地區別', 9, '瑞穗鄉', 19),
    (2, '地區別', 10, '富里鄉', 19),
    (2, '地區別', 11, '秀林鄉', 19),
    (2, '地區別', 12, '萬榮鄉', 19),
    (2, '地區別', 13, '卓溪鄉', 19),
    (2, '地區別', 14, '山地鄉', 19);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '馬公市', 20),
    (2, '地區別', 2, '湖西鄉', 20),
    (2, '地區別', 3, '白沙鄉', 20),
    (2, '地區別', 4, '西嶼鄉', 20),
    (2, '地區別', 5, '望安鄉', 20),
    (2, '地區別', 6, '七美鄉', 20);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '烏坵鄉', 21),
    (2, '地區別', 2, '金城鎮', 21),
    (2, '地區別', 3, '金湖鎮', 21),
    (2, '地區別', 4, '金沙鎮', 21),
    (2, '地區別', 5, '金寧鄉', 21),
    (2, '地區別', 6, '烈嶼鄉', 21);

INSERT INTO
    CommonType (
        code_type,
        code_type_desc,
        code_id,
        code_desc,
        code_remark
    )
VALUES (2, '地區別', 1, '南竿鄉', 22),
    (2, '地區別', 2, '北竿鄉', 22),
    (2, '地區別', 3, '莒光鄉', 22),
    (2, '地區別', 4, '東引鄉', 22);

-- 員工
create table Employees (
    employee_id int not null primary key auto_increment,
    employee_name varchar(10),
    employee_email varchar(100) not null unique, -- 註冊用的email不可重複
    employee_password varchar(70)
);

create table EmployeeDetail (
    employeedetail_id_fk int not null primary key auto_increment,
    employeedetail_imgurl varchar(50) not null default '../images/default_avatar.jpg', -- 可以不放大頭貼，若不放會顯示一個預設圖示
    employeedetail_created_date timestamp default current_timestamp,
    employeedetail_update_at timestamp default current_timestamp on update current_timestamp,
    foreign key (employeedetail_id_fk) references Employees (employee_id) on delete cascade -- 基本表被刪,細節表內同筆id也被刪
);

-- 會員部分
-- 會員基本表
CREATE TABLE Members (
    member_id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    member_name VARCHAR(10),
    member_email VARCHAR(100) NOT NULL UNIQUE, -- 註冊用的email不可重複
    member_password VARCHAR(70) NOT NULL,
    gender VARCHAR(10),
    nick_name VARCHAR(10),
    avatar VARCHAR(200) NOT NULL DEFAULT 'default_avatar.jpg', -- 可以不放大頭貼，若不放會顯示一個預設圖示
    mobile VARCHAR(50) NULL, -- 要驗證時需指定用戶輸入的格式避免0900-000-000
    city_id INT,
    district_id INT,
    address VARCHAR(300),
    resetToken VARCHAR(300) NULL, -- 重置密碼時使用的隨機生成的token，用以核對用戶身分
    resetExpiration DATETIME NULL, -- 這是一個時間戳記，用來判斷token是否過期
    lastRequestTime DATETIME NULL, -- 這是一個時間戳記，用來紀錄用戶上次發送驗證信申請的時間，發送時間與當前時間相差需在1分鐘以上
    created_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    update_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);

insert into
    Employees (
        employee_name,
        employee_email,
        employee_password
    )
values (
        '快速登入',
        'quicklogin@quick.com',
        'user1'
    ),
    (
        '陳彥寧',
        'yan@mail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '陳延汝',
        'lulu@mail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '潘牙牙',
        'yap@mail.com',
        '$2y$10$xsYD/hEF9HkVhx32CfSaJuV2Q3Na9CMwfLbB.f1UHeqYNuGXm7oC6'
    ),
    (
        'sofi',
        'sophie@mail.com',
        '$2y$10$CUogBGQLwD1flFwkby5o8eEPGO3aeqtEQYYUppmrMY4QB8M2zEbZW'
    ),
    (
        'suan',
        'suan@mail.com',
        '$2y$10$v2qRZiUgT8XuGGijVBLrLeLrMGXu0CIXpHvt.g8W1msjWR3aNLlEq'
    ),
    (
        '李俊翰',
        'randomuser1@gmail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '蔡欣怡',
        'testmail4321@gmail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '林志宇',
        'emailgenie89@gmail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '鄭婷婷',
        'examplemail567@gmail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    ),
    (
        '楊子翔',
        'quickmail1234@gmail.com',
        '$2y$10$5NoKPGQWJqJGnDlJHWrDQ.wkq7bSLHhBuNU3A36wrGdi0MnpstW/6'
    );

-- 建立 場館基本資料列表 Gyms
create table Gyms (
    gym_id int primary key auto_increment,
    gym_name varchar(250) not null,
    commontype_id_fk int not null, -- 地區代碼
    gym_address varchar(500) not null,
    gym_phone varchar(13),
    gym_price varchar(200),
    is_elderly int,
    gym_info text,
    gym_cover_url varchar(200),
    create_at timestamp default current_timestamp,
    update_at timestamp default current_timestamp on update current_timestamp,
    foreign key (commontype_id_fk) references CommonType (commontype_id) -- 連結CommonType
);

select * from Gyms;

-- 教練照片表
CREATE TABLE CoachImgs (
    coachImgs_id INT PRIMARY KEY AUTO_INCREMENT,
    coach_img VARCHAR(200)
);

-- 插入教練照片表的資料
INSERT INTO
    CoachImgs (coach_img)
VALUES ('coach1.jpg'),
    ('coach2.jpg'),
    ('coach3.jpg'),
    ('coach4.jpg'),
    ('coach5.jpg'),
    ('coach6.jpg'),
    ('coach7.jpg'),
    ('coach8.jpg'),
    ('coach9.jpg'),
    ('coach10.jpg'),
    ('coach11.jpg'),
    ('coach12.jpg'),
    ('coach13.jpg'),
    ('coach14.jpg');

-- 教練表
CREATE TABLE Coaches (
    coach_id INT PRIMARY KEY AUTO_INCREMENT,
    coach_name VARCHAR(10),
    coach_phone VARCHAR(10),
    coach_gender INT,
    coach_info VARCHAR(500),
    coach_price INT,
    create_date DATE,
    update_at TIMESTAMP DEFAULT NOW(),
    coachImgs_id INT,
    gym_id INT,
    FOREIGN KEY (coachImgs_id) REFERENCES CoachImgs (coachImgs_id),
    FOREIGN KEY (gym_id) REFERENCES Gyms (gym_id)
);

-- 教練和課程類型的中間表
CREATE TABLE CoachSkills (
    coach_id INT,
    commontype_id INT,
    FOREIGN KEY (coach_id) REFERENCES Coaches (coach_id),
    FOREIGN KEY (commontype_id) REFERENCES CommonType (commontype_id),
    PRIMARY KEY (coach_id, commontype_id)
);

-- 课程照片表
CREATE TABLE LessonImgs (
    LessonImgs_id INT PRIMARY KEY AUTO_INCREMENT,
    lesson_img VARCHAR(200)
);

-- 课程表
CREATE TABLE Lessons (
    lesson_id INT PRIMARY KEY AUTO_INCREMENT,
    lesson_name VARCHAR(50),
    lesson_state INT,
    lesson_price INT,
    lesson_desc VARCHAR(400),
    lesson_date DATETIME, -- 课程时间
    LessonImgs_id INT, -- 课程照片
    coach_id INT,
    gym_id INT, -- 新增的场馆外键
    FOREIGN KEY (LessonImgs_id) REFERENCES LessonImgs (LessonImgs_id),
    FOREIGN KEY (coach_id) REFERENCES Coaches (coach_id),
    FOREIGN KEY (gym_id) REFERENCES Gyms (gym_id) -- 连接 Gyms 表格
);

-- 课程和课程类别的中间表
CREATE TABLE LessonCategories (
    lesson_id INT,
    commontype_id INT,
    FOREIGN KEY (lesson_id) REFERENCES Lessons (lesson_id),
    FOREIGN KEY (commontype_id) REFERENCES CommonType (commontype_id),
    PRIMARY KEY (lesson_id, commontype_id)
);

-- ---------------------------ProductTypes----------------------
create table ProductTypes(
ProductTypes_Id    int auto_increment primary key,
ProductTypes_name  varchar(50),
ProductTypes_parenti_id  int

);
insert into ProductTypes(ProductTypes_name,ProductTypes_parenti_id)
value 
('居家訓練', '0'),('運動服飾','0'),('健身護具','0'),('健康食品','0');
insert into ProductTypes (ProductTypes_name,ProductTypes_parenti_id)
value 
('護膝', '3'),('護腿','3'),('護踝','3'),('護腰','3');

-- -----------------------------Products----------------------------------
create table  Products(
Product_id int auto_increment primary key,
Product_name varchar(50),
Product_photo varchar(500),
Product_desc varchar(500),
Product_price int,
Product_inventory int ,
Product_type_id_fk int,
Suppliers_id_fk int,
Product_list_update  timestamp not null default now(),
Product_change_update timestamp,
Product_employee_id_fk int,
Product_state int,
foreign key (Suppliers_id_fk) references commontype(commontype_id),
foreign key (Product_type_id_fk) references commontype(commontype_id),
foreign key (Product_employee_id_fk) references Employees(employee_id),
foreign key  (Product_state) references commontype(commontype_id)
);
insert into products (Product_name,Product_photo,Product_desc,Product_price,Product_inventory,Product_type_Id_fk,suppliers_id_fk,Product_employee_id_fk,Product_state )
     value ('防滑啞鈴','traning1.jpg,traning2.jpg,traning3.jpg,traning4.jpg','多樣性訓練：啞鈴適用於全身各部位的肌肉鍛煉，可以進行多種動作，如臥推、划船、深蹲等，滿足各種健身需求。靈活調節：可調節啞鈴允許用戶根據自身需求自由增減重量，提供極大的靈活性，適應不同強度的訓練。空間節省：相較於大型健身設備，啞鈴佔用空間小，便於家庭使用，易於存放和攜帶。','1000','100','50','45','2','98'),
('競技壺玲','traning6.jpg,traning7.jpg','用壺鈴能鍛練力量（絕對力量，爆發力），能鍛練耐力（高強度有氧訓練，爆發耐力訓練，肌肉耐力訓練），能鍛練柔韌性。從壺鈴訓練的效果來說能增加肌肉，減少脂肪，全面提高身體素質。壺鈴是一個自由重量訓練器械；跟啞鈴的差別是它的形狀與它的重量中心。因為“形狀”與啞鈴不同，所以壺鈴在爆發力訓練（抓舉，挺舉，擺）和耐力有氧訓練（擺，抓舉）方面有更好的效果。','250','11','50','46','2','98'),
('小飛碟運動沙包','traning8.jpg,traning9.jpg','神奇飛碟沙袋肌力運動！運動沙包，健身沙袋，耐用好抓取，可做手抓、舉、拋、接、摔、捧、抱，柔軟親膚，重量訓練、肌力核心鍛練、趣味銀髮族運動，肌耐力、肌爆發力、心肺有氧，有趣的運動用品。沙包以布料為外表，內為重量石沙，布表面的特色容易抓取和捧握，手感較為好。重量從1kg~12kg都有，目前負重沙袋是蠻多健身房教練會置入肌力訓練課程，蠻受輕肌力運動女孩、銀髮族、兒童運動等的喜愛。','320','22','50','48','2','98'),
('彈力藥球','traning11.jpg,traning10.jpg','鍛鍊核心肌群、增強力量、提高協調性，藥球全方位訓練你的身體，讓你更健康、更有活力！高品質材料，防滑設計，適合各種運動場地使用。不論是室內或戶外運動，都是最佳選擇。讓您充分發揮自身潛力。透過彈力藥球的訓練，不僅可以增強肌肉力量，也可以增加協調性和平衡感。適合各種運動水平的使用者，不論是運動初學者或是運動員，都能夠輕鬆上手。','1200','23','50','47','3','99'),
('軟重力球','traning16.jpg,traning17.jpg,traning18.jpg,traning19.jpg','球體表面需配合手部動作有防滑作用，輕鬆可以夾取，內為流動鐵砂，重量100g～500g，給予肌肉適當重力壓力，流動鐵砂，抓取時能同步訓練手指手掌力，尺寸7cm適中於手掌大小，能靈活手指同步運動','2000','40','50','46','5','99'),
('軟式壺鈴','traning20.jpg,traning21.jpg','軟式壺鈴不傷地板，重訓選軟式壺鈴。高耐磨布、多重量選擇、車工好、材質柔軟，專為健身、重量訓練設計。輕肌力訓練、肌耐力提升、心肺有氧，多運動動作應用，健身房女性、男性、銀髮族、兒童都適合','650','40','50','47','5','99'),
('彈力帶握把組','traning22.jpg,','TPU材質，彈力伸展好使力，不分年齡皆可使用、肢體動作隨意變化、輕巧好收藏，亮麗配色、運動便利性簡單性，人人可以使用。','300','100','50','47','4','99'),
('彼拉提斯伸展彈力帶','traning24.jpg','針對全身的肌肉運動設計、彼拉提斯配合韻律動作，可使腰.臂.臀.腿充分的可達運動效果、訓練踢腿力、讓腿部更有線條美、鍛練手拉力、健康有活力 ','300','200','50','48','3','99'),
('高彈棉織彈力繩','traning25.jpg,traning26.jpg,traning27.jpg','彈力帶可以調整關節和提升肌耐力，減少關節的壓力。因為有提升肌力的效果、而棉織彈力帶材質較為舒適，沒有以往橡膠彈力帶，可能會引起纏繞體毛或刮傷您的皮膚，產生不舒適感。此款彈力帶使用起來親膚舒適，使用一段時間後，也可以直接丟入洗衣機清洗。','1000','2','50','49','2','99'),
('瑜珈墊','traning28.jpg,traning29.jpg','本款多功能運動墊厚度達1cm，長度達180公分，寬度達90cm，支撐力效果很好，男女生都適合，質地柔軟觸感舒、適，可以阻隔地板的寒氣，減輕身體的負擔，是一款能完全滿足您瑜珈、運動使用。不管是去健身房使用，或是在家使用，都是最好的選擇！','2500','100','50','47','5','98'),
('超厚運動墊','traning31.jpg,traning32.jpg,traning33.jpg','超厚瑜伽墊專為追求舒適性和穩定性的瑜伽愛好者設計，提供優異的支撐和緩衝效果。無論是初學者還是經驗豐富的瑜伽練習者，都能在這款瑜伽墊上找到理想的鍛煉體驗。優越的厚度：6毫米以上的加厚設計，提供更好的緩衝效果，有效保護關節和膝蓋，減少運動中的不適感。高密度材質：採用高品質的TPE（熱塑性彈性體）或EVA（乙烯-醋酸乙烯酯）材質，具備優異的耐磨性和抗撕裂性，經久耐用。','1200','100','50','46','2','99'),
('瑜珈球25cm','traning34.jpg,traning35.jpg,traning36.jpg','瑜伽球是一種多功能的健身器材，廣泛應用於瑜伽、普拉提、康復訓練和核心肌群鍛煉。其彈性和不穩定性有助於提升平衡能力和肌肉力量，是家庭和健身房必備的運動夥伴。採用高品質PVC材料製成，環保無毒，耐磨耐用，提供舒適的觸感和優異的支撐力、內置防爆技術，即使在高壓下也不易爆裂，確保使用安全。','1400','100','50','46','4','99'),
('瑜珈筋膜球','traning37.jpg,traning38.jpg','瑜伽筋膜球是一款專為深層組織按摩和筋膜放鬆設計的健身器材。它能有效緩解肌肉緊張和酸痛，促進血液循環，提高運動表現。無論是運動前的熱身還是運動後的恢復，瑜伽筋膜球都是您的理想選擇。且符合人體工學設計，球面有細微顆粒或紋理，增加摩擦力，提供更深層次的按摩效果、小巧輕便，方便攜帶和使用，隨時隨地進行筋膜放鬆和肌肉按摩。','3000','24','50','46','4','99'),
('肌筋膜花生按摩球','traning39.jpg,traning40.jpg,traning41.jpg,traning42.jpg','有彈性不傷筋膜-肌筋膜花生球按摩球深層按壓有效!肌筋膜花生按摩球，天然橡膠花生球，些許彈性，初使用者按壓時，對於患部不會太刺激花生球可觸達肌肉及筋膜深處，深層放鬆肌肉。','2300','100','50','46','4','99'),
('深層按摩花生球','traning43.jpg,traning44.jpg','尖點除痛痛花生球是一款專為深層組織按摩和筋膜放鬆設計的雙球形按摩器材，形狀類似花生，因此得名。其獨特的設計能夠有效針對肌肉緊張、酸痛和結節，特別適合背部、頸部和肩部的深層按摩，幫助您迅速緩解不適，恢復活力。雙球形設計更符合人體工學，能夠更好地貼合身體曲線，提供針對性的按摩效果、球面覆有尖點設計，增強按摩效果，有效針對肌肉結節和緊張部位，提供更深層次的放鬆。','1400','100','50','46','4','99'),
('筋膜按摩滾筒','traning45.jpg,traning46.jpg,traning47.jpg','筋膜按摩滾筒是一款多功能的健身輔助器材，專為深層組織按摩和筋膜放鬆設計。其表面特有的凹凸結構能夠有效針對肌肉緊張、酸痛和結節，促進血液循環，提升運動表現。無論是運動前的熱身還是運動後的恢復，筋膜按摩滾筒都是您的理想選擇。','1000','100','50','46','4','99'),
('翹臀深蹲環狀阻力帶','traning48.jpg,traning49.jpg,traning50.jpg','翹臀深蹲環狀阻力帶是一款專為臀部和腿部鍛煉設計的便攜式健身器材。它能夠有效增強肌肉力量，提升臀部線條和腿部力量，是家庭健身和專業訓練的理想選擇。','360','100','50','46','4','99'),
('體能火箭筒','traning52.jpg,traning51.jpg,traning53.jpg','體能火箭筒是一款多功能的全身鍛煉器材，專為提升力量、爆發力、耐力和協調性而設計。其獨特的設計能夠模擬各種推、拉、抬等運動動作，是家庭健身、專業訓練和戶外運動的理想選擇。','500','100','50','46','4','99'),
('健身平衡墊','traning54.jpg,traning56.jpg','健身平衡墊是一款設計精良的健身器材，旨在提升平衡能力、穩定性和核心力量。它由高品質的柔軟材料製成，表面紋路設計提供額外的抓地力，適合各種健身活動和訓練場合使用。無論是瑜伽、平衡訓練還是康復運動，健身平衡墊都能有效幫助用戶改善姿勢，增強肌肉控制力，並減少受傷風險。','1100','100','50','46','4','99'),
('可調式腳踝負重袋','traning57.jpg,traning58.jpg','可調式腳踝負重袋是一種設計用來增加運動負荷的健身器材。通常被戴在腳踝上，用於各種訓練和運動中，特別是提高下肢力量和耐力的運動中常見使用， 可根據個人的訓練需求調整重量，通常由小重量單元組成，每個單元可以添加或移除，以增加或減少負重。','500','100','50','46','4','99'),
('女裝五分合身褲','cloth1.jpg,cloth2.jpg','裁剪貼合身形，突顯身材曲線，適合女性穿著、使用彈性良好的面料，如彈性棉布、彈性纖維等，使穿著更加舒適和自由、適合日常休閒穿著、運動、健身或居家活動，提供適當的舒適度和活動空間。','1900','100','51','45','2','98'),
('男裝健身背心','cloth3.jpg,cloth4.jpg,cloth5.jpg','使用透氣材料，如透氣網布或快乾面料，有助於排汗和保持涼爽、 具有良好的彈性，提供運動中所需的自由度和舒適感、 設計適合於各種運動，如跑步、健身、籃球等，有助於提升運動表現','590','100','51','45','2','98'),
('女裝健身背心','cloth7.jpg,cloth8.jpg','透氣性和快乾性： 使用透氣和快乾材料，有助於排汗和保持涼爽，使穿著者在運動中感到舒適、 具有彈性良好的面料，提供運動所需的自由度和靈活性，不會限制動作、常為修身設計，貼合女性身形，突顯身材曲線，同時提供適當的支持和舒適度','590','100','51','45','2','98'),
('女裝落肩短袖上衣','cloth9.jpg','衣剪裁寬鬆，不貼身，有助於增加穿著者的舒適感和自由度、短袖適合春夏季節穿著，適合各種日常活動和室外運動。','890','100','51','45','2','98'),
('女裝跑步短褲','cloth10.jpg,cloth11.jpg,cloth13.jpg','使用透氣和快乾材料，有助於排汗和保持涼爽，使穿著者在運動中感到舒適、 具有彈性良好的面料，提供運動所需的自由度和靈活性，不會限制動作。','890','100','51','45','2','98'),
('女裝合身短袖上衣','cloth14.jpg,cloth15.jpg','使用透氣和快乾材料，有助於排汗和保持涼爽，使穿著者在運動中感到舒適、 具有彈性良好的面料，提供運動所需的自由度和靈活性，不會限制動作。','690','100','51','45','2','98'),
('運動伸展褲','cloth16.jpg,cloth17.jpg,cloth18.jpg','九分褲長，俐落健身運動、中高腰設計，好活動自如、適合瑜珈等大伸展動作','980','100','51','45','2','98'),
('運動內衣','cloth19.jpg,cloth20.jpg,cloth21.jpg','固定式罩杯美化胸型、肩帶可任意調整、背後輕爽透氣網布、背後大水滴挖空不悶熱','833','100','51','45','2','98'),
('男裝落肩短袖上衣','cloth22.jpg','上衣剪裁寬鬆，不貼身，有助於增加穿著者的舒適感和自由度、短袖適合春夏季節穿著，適合各種日常活動和戶外運動。','1200','100','51','45','2','98'),
('男能量上衣','cloth24.jpg,cloth25.jpg,cloth26.jpg','專利負離子、遠紅外線材質、居家外出皆可穿著、簡約設計，勁黑運動精神、較為合身設計方便運動','880','100','51','45','2','98'),
('男裝雙層運動短褲','cloth27.jpg,cloth28.jpg','外層通常為寬鬆的運動短褲，內層為緊身褲或內襯，提供額外的支持和保護，避免摩擦和不適、內層和外層都具有良好的彈性，提供運動所需的自由度和靈活性，不會限制動作。','1590','100','51','45','2','98'),
('印花短袖','cloth29.webp','Oversize寬鬆版型，時尚與舒適兼具、居家穿著，日常休閒，輕鬆穿搭','790','100','51','45','2','98'),
('涼感彈力合身運動背心','cloth30.webp,cloth31.webp','合身訓練背心版型，貼合身體曲線、後背配色線條、漸層感品牌印花，增添層次感','690','100','51','45','2','98'),
('連帽背心','cloth32.webp,cloth33.webp,cloth34.webp','胸前胸骷髏印花，展現品牌暗黑風格','990','100','51','45','2','98'),
('經典除臭機能船型薄襪','cloth35.webp,cloth36.webp','本產品採用台灣工業技術研究院之32支精梳棉抑菌紗與杜邦萊卡彈性纖維製作，並由200針細針織襪機台編織而成','400','100','51','45','2','98'),
('惡名昭彰船型襪','cloth37.jpg,cloth38.jpg','本產品採用台灣工業技術研究院之32支精梳棉抑菌紗與杜邦萊卡彈性纖維製作，並由200針細針織襪機台編織而成','700','100','51','45','2','98'),
('棉感五分單車褲','cloth39.jpg,cloth40.jpg,cloth41.jpg','仿棉的細緻手感，彈性優異、吸濕排汗材質，親膚舒適且乾爽、五分單車褲設計，剪接線條具修飾功能、側腰精緻女款LOGO刺繡','700','100','51','45','2','98'),
('剪接修身機能短袖','cloth42.jpg,cloth43.jpg','銀離子材質，抑菌抑臭效能、優異吸濕快乾、透氣，穿著乾爽舒適、前後延伸立體剪裁，修飾身形、自在不受限','590','100','51','45','2','98'),
('柔感彈力緊身褲','cloth44.webp,cloth45.webp,cloth46.webp','彈性腰圍 - 鬆緊腰頭舒適不卡卡，打造專屬貼合度、吸濕快乾 - 輕量排汗纖維機能，保持整日肌膚乾爽不沾黏、修身版型 - 立體剪裁修飾身形曲線，專注訓練動作不受限','890','100','51','45','2','98'),
('紅肌完美蛋白粉-靜岡抹茶','food1.jpg,food2.jpg','自然順口好喝、完美蛋白，精準胺基酸比例、提升運動表現、肌肉生長、減輕負擔','800','100','53','45','2','98'),
('修復盒子-熱帶莓果味','food3.jpg','有效提升肌膚水分、有效減少皮膚搔癢、運動後恢復肌膚活麗、促進新成代謝','1100','100','53','45','2','98'),
('無氧運動專用蛋白補給品-豆乳紅茶口味','food4.jpg,food5.jpg','蛋白質補充新革命-蛋白質4.0: 專為白肌打造的營養配方，最有效的蛋白補充飲一包含有24.5克蛋白質無乳糖配方自然順口好喝爆發力型/無氧運動設計的蛋白補給品','590','100','53','45','2','98'),
('分離乳清蛋白【優格多多】隨身包35克-果果能量','food6.webp,food7.webp','優格的奶香搭配剛剛好的多多酸甜，充滿年輕感的朝氣風味，清爽酸甜讓訓練後的辛苦一掃而空。1.每份約含28g蛋白質2.純分離乳清，適合乳糖不耐者飲用3.採用國際知名大廠乳清蛋白4.營養吸收快、容易溶解並且低脂肪含量5.添加水溶性膳食纖維，有助於維持消化道機能，促進體內益生菌生長','45','100','53','45','2','98'),
('濃縮乳清蛋白【紅豆歐蕾】500克-果果能量','food8.webp,food9.webp','1.每份約含17g蛋白質2.選用紐西蘭優質乳清蛋白3.營養吸收快、奶味較香濃、容易溶解4.富含BCAA及所需胺基酸5.添加水溶性膳食纖維，有助於維持消化道機能，促進體內益生菌生長','499','100','53','45','2','98'),
('脆米蛋白棒【双癒可可】-果果能量','food10.webp,food11.webp','香甜巧克力口味，療癒你的點心時刻- 健康的高蛋白零食，每份含有 12 克蛋白質- 蛋白脆米粒加量 +50% 改版新上市- 添加異麥芽寡糖，有效提升飽足感、減少攝取熱量- 使用 MCT 好油，不易囤積形成負擔','64','100','53','45','2','98'),
('脆米蛋白棒【極真抹茶】-果果能量','food12.webp,food13.webp','香濃日式抹茶口味，享受清新抹茶香氣- 健康的高蛋白零食，每份含有 12 克蛋白質- 蛋白脆米粒加量 +50% 改版新上市- 添加異麥芽寡糖，有效提升飽足感、減少攝取熱量- 使用 MCT 好油，不易囤積形成負擔','64','100','53','45','2','98'),
('脆米蛋白棒【果果乳加】-果果能量','food14.webp,food15.webp','香濃乳加口味，享受清新抹茶香氣- 健康的高蛋白零食，每份含有 12 克蛋白質- 蛋白脆米粒加量 +50% 改版新上市- 添加異麥芽寡糖，有效提升飽足感、減少攝取熱量- 使用 MCT 好油，不易囤積形成負擔','64','100','53','45','2','98'),
('蛋白威化餅【濃韻焙茶】-果果能量','food16.webp,food17.webp','一口咬下是威化餅的酥脆口感和清新焙茶蛋白內餡，四層酥脆威化餅讓每一口都是多層次的酥脆享受不同於市售威化餅吃起來口乾、還含有高油脂高糖分，果果能量蛋白威化餅每支含有 9 克蛋白質，並添加 MCT 中鏈脂肪酸，減輕身體負擔，非常適合正在飲食控制者和努力健身的你！','42','100','53','45','2','98'),
('蛋白威化餅【藍莓起司】-果果能量','food18.webp,food19.webp','四層酥脆威化餅乾夾著迷人的藍莓起司蛋白內餡，每一口都是多層次不甜膩的酥脆享受，不同於市售威化餅吃起來口乾、還含有高油脂高糖分，果果能量蛋白威化餅每支含有 9 克蛋白質，並添加 MCT 中鏈脂肪酸，減輕身體負擔，非常適合正在飲食控制者和努力健身的你！','42','100','53','45','2','98'),
('有機乳清蛋白粉','food20.jpg,food21.jpg','這款有機乳清蛋白，通過嚴格質量把控，獲得有機乳製品的認證，奶牛也均以最自然的方式餵養。通過飼料豐富的綠色牧場的培養，我們的奶牛乳清經過超過提供卓越的品質，帶給你每份高達20克的蛋白質 ','1380','100','53','45','2','98'),
('減重高蛋白配方粉','food22.jpg,food23.jpg','減重高蛋白配方粉 採用科學配方，專為女性運動人群而設計，幫助促進女性積極健康的生活方式。此款產品是一款口味極佳的高蛋白奶昔，具有極高的營養價值，同時又很容易消化。','8310','100','53','45','2','98'),
('高蛋白威化餅乾','food24.jpg,food25.jpg,food26.jpg','高蛋白威化餅乾是一款蛋白質含量很高的美味零食，將牛奶分離蛋白和乳清分離蛋白完美結合在一起，口感極佳，新增花生醬味、曲奇餅乾和奶油味、巧克力榛子味三種新口味，目前我們的產品系列包括六種絕佳口味，為您提供更多選擇。非常適合生活緊張忙碌需要添加營養者，或作為訓練期間的蛋白質補充品食用','560','100','53','45','2','98'),
('蘋果醋軟糖','food27.jpg','想要使蘋果醋成為您日常的一部分，而又不會在您的口中留下難聞的味道嗎？我們為您提供了這款美味的蘋果味軟糖。富含維他命 C，可幫助保護細胞抵抗氧化應激1, 抗疲勞2, 並保持免疫系統強健3 --幫助您從內而外感覺最佳。','1250','100','53','45','2','98'),
('益生菌軟糖','food28.jpg','益生菌軟糖是支持您的健康和福祉的簡單方法 - 它們經過專業配製，含有 10 億種活菌以及 40 毫克維生素 C，可支持免疫系統健康。','1690','100','53','45','2','98'),
('日常綜合維他命片','food29.jpg','核黃素（維他命 B2）有助於正常能量產出代謝系統、正常神經系統運作、人體紅細胞的維持、有助於減少疲勞和細胞的氧化應激保護。硫胺素（維他命 B1）有助於正常能量產生代謝、正常神經系統功能、正常心臟功能和心裡機能。','1100','100','53','45','2','98'),
('【自由調節 降低酸痛】ipure-能量護膝條','protect1.jpg,protect2.jpg,protect3.jpg,protect4.jpg','結合負離子及遠紅外線的能量護具，形成貼身包覆的保護層、加速身體達到熱身狀態，減少運動傷害，更有效防護、以彈性材質設計，可調整具有強力伸縮性，穿戴兼具彈性與便利、適用於運動員、長期工作之上班族以及膝蓋酸痛所造成的不舒服感','400','100','52','45','2','98'),
('可調式膝關節護具','protect5.jpg','X型護具包含下髕骨的支撐以及X型的調整彈性支撐帶，兩層式設計提供更佳的保暖效果。此外，內側和外側還有螺旋支撐條為膝關節的韌帶提供額外的穩定性、提供保溫，壓縮和膝關節穩定性的效果、提供膝關節支撐和穩定性，適用於膝蓋受傷包括髕骨 - 股骨疼痛和中度韌帶撕裂傷。也可以為半月面撕裂提供有效適當的支撐性。','1160','100','52','45','2','98'),
('健身護膝','protect6.jpg,protect7.jpg',' 提供額外的支撐，減少膝蓋在運動中的壓力和損傷，預防受傷、有助於減輕膝蓋疼痛和不適，特別是對於有膝關節問題或在高強度運動中使用、 適合多種運動，如跑步、健身、舉重、籃球、足球等，也適合日常活動和康復訓練使用。','600','100','52','45','2','98'),
('膝蓋提升式護具','protect8.jpg',' 膝關節加壓帶,在髕骨(膝蓋骨)下方，以彈力提升支撐，將髕骨肌腱周圍的壓力平均分散，減少不適與對髕骨肌腱的刺激，彈性伸縮加壓帶，可同時保護膝蓋及膝蓋肌鍵，護膝加壓帶，保護功效獨特，為美國運動員研發實驗生產。','790','100','52','45','2','98'),
('開放式膝關節護具','protect9.jpg',' 保護支撐中度級膝蓋、保護支撐中度級膝蓋。','590','100','52','45','2','98'),
('X型直套式膝關節加壓帶','protect10.jpg','上下加壓穩定膝蓋提供更佳的支撐、加強支撐髕骨和四頭肌腱。支撐保護因髕骨(膝蓋下側)異位可能導致的軟骨軟化和髕骨股骨(膝蓋下側)疼痛。','1090','100','52','45','2','98'),
('一般型護腰帶','protect11.jpg','運動健身機能性護具，減輕腰部壓力，舒緩下背，好品質護腰帶,護腰,束腹帶,健身護腰帶,工作護腰帶，特殊杜邦材料，達到保暖支撐效果，寬版設計，保護更全面','720','100','52','45','2','98'),
('(骶髂關節) 護腰帶','protect12.jpg','S.I.(骶髂關節)護腰帶為臀部和骶骨提供穩定性。S.I.(骶髂關節)護腰帶圍繞臀部比大多數護腰帶更低。壓縮襯墊與第二組外帶結合提供骶骨更有效的支撐保護及壓縮。另外，防滑膠有助於保持骶髂關節護腰帶保持在固定位置。','1190','100','52','45','2','98'),
('彈力護腰帶拉環式','protect13.jpg','適合各種運動/休閒/工作、產後身材恢復/司機/作業員、久坐/久站/銀髮..等','1980','100','52','45','2','98'),
('9吋護腰','protect14.jpg','遠紅外線材質恆定體溫、強力記憶塑條穩定姿勢、雙層網覆繃帶舒適加壓、特殊魔鬼氈好撕黏不易繃開','1380','100','52','45','2','98'),
('石墨烯 黑科技機能護腰帶','protect16.webp,protect17.webp','體內水分子活化，改善循環系統，精力更旺盛透氣加壓束帶，2測加壓符合各種身形','2380','100','52','45','2','98'),
('脛骨(小腿)護具加壓帶','protect18.jpg','脛骨(小腿)護具加壓帶，可以對脛骨(小腿)旁邊的肌肉施加輕柔的壓力，有助於防止肌肉的撕裂傷。壓縮不僅可以減少額外的撕裂傷，也可以舒緩疼痛和幫助癒合。此外，使用小腿護具也可以吸收活動時對於小腿的壓力。','990','100','52','45','2','98'),
('緩震小腿襪','protect20.png','內置緩震墊，能有效吸收運動中的衝擊力，減少小腿和腳踝的壓力，提供額外的保護、提供小腿肌肉的支撐，減少運動中的疲勞感和抽筋現象，提升運動表現、 使用透氣和排汗材料，有助於保持小腿乾爽，避免過多出汗引起的不適感。','350','100','52','45','2','98'),
('束小腿','protect21.webp','長程運動、出遊、日常久站久走的好朋友，長時間穿戴也貼合舒適。','2500','100','52','45','2','98'),
('機能壓縮小腿套','protect22.webp,protect23.webp','將性能與舒適性完美結合、協助支撐、釋放循環爆發力、材質舒適可機洗，耐久用不易鬆脫、不易滑落專注訓練 發揮最高性能','870','100','52','45','2','98'),
('跑步壓力腿套','protect24.webp,protect25.webp,protect26.webp','我們的設計團隊開發出這款能提升跑步表現的跑步壓力產品。透過為肌肉加壓提升運動表現。為何要替小腿加壓？可以促進血液循環、減少肌肉震動並改善肢體動作。','870','100','52','45','2','98'),
('冷矽型腳踝關節護具','protect27.jpg','透氣柔軟的特殊材質提供上下左右4個方向的平均拉伸展。厚橢圓形的冷矽墊為髕骨（膝蓋）區域提供優異的舒適性和支撐性。內側和外側的螺旋支撐條提供整體膝關節更佳的穩定性、適合籃球、排球、羽球、網球、高爾夫球、棒球、爬山、慢跑等競技或休閒運動。','790','100','52','45','2','98'),
('3D功能型踝部護具','protect28.jpg','籃球、排球、羽球、網球、高爾夫球、棒球、爬山、慢跑等競技或休閒運動、適用於輕或中度的腳踝扭傷。','790','100','52','45','2','98'),
('十字型阿基里肌腱足部護具','protect29.jpg','十字型阿基里肌腱-足部護具護踝，採用最新的EVA輪廓軟墊，環繞阿基里肌腱，更舒適的穩定性，穿戴時因其透氣、多方向性應力伸展特點，活動靈活，更保持高效支撐保護作用。','990','100','52','45','2','98'),
('伸縮調整式足弓墊一雙','protect30.jpg','採用新型EVA材料成形的足弓支撐墊，提供內側足弓針對性的支撐。此外，足弓墊製作方式使用熱封式黏貼而非縫合，減少足弓墊的厚度，穿在鞋內更佳貼合及舒適','990','100','52','45','2','98'),
('功能型足踝部護具','protect31.jpg','特別的裁縫方式，專門針對腳弓，腳跟和阿基里腱提供更精確的保護穩定性。此外，在足弓和足跟處也特別加強壓縮力以提高支撐性、適用於足底肌膜炎','720','100','52','45','2','98'),
('腳踝部護具','protect32.jpg','保暖熱作用可以幫助韌帶的靈活性,以減少扭傷和撕裂傷的機會，壓縮作用可提供支撐及遏制肌肉發炎、適用於提供踝部保暖和壓縮支撐作用，適用於踝部扭傷。','440','100','52','45','2','98'),
('可調整式踝部護具支撐帶','protect33.jpg','可調整式踝部護具支撐帶,杜邦合成橡膠材質提供保溫和加壓保護的作用，伸縮彈性帶可以隨使用者的情況自行調整緊鬆定。穿鞋子也可使用','790','100','52','45','2','98'),
('【自由調節 降低酸痛】ipure-能量護膝條','protect1.jpg','結合負離子及遠紅外線的能量護具，形成貼身包覆的保護層、加速身體達到熱身狀態，減少運動傷害，更有效防護、以彈性材質設計，可調整具有強力伸縮性，穿戴兼具彈性與便利、適用於運動員、長期工作之上班族以及膝蓋酸痛所造成的不舒服感','400','100','54','45','2','98'),
('可調式膝關節護具','protect5.jpg','X型護具包含下髕骨的支撐以及X型的調整彈性支撐帶，兩層式設計提供更佳的保暖效果。此外，內側和外側還有螺旋支撐條為膝關節的韌帶提供額外的穩定性、提供保溫，壓縮和膝關節穩定性的效果、提供膝關節支撐和穩定性，適用於膝蓋受傷包括髕骨 - 股骨疼痛和中度韌帶撕裂傷。也可以為半月面撕裂提供有效適當的支撐性。','1160','100','54','45','2','98'),
('健身護膝','protect6.jpg',' 提供額外的支撐，減少膝蓋在運動中的壓力和損傷，預防受傷、有助於減輕膝蓋疼痛和不適，特別是對於有膝關節問題或在高強度運動中使用、 適合多種運動，如跑步、健身、舉重、籃球、足球等，也適合日常活動和康復訓練使用。','600','100','54','45','2','98'),
('膝蓋提升式護具','protect8.jpg',' 膝關節加壓帶,在髕骨(膝蓋骨)下方，以彈力提升支撐，將髕骨肌腱周圍的壓力平均分散，減少不適與對髕骨肌腱的刺激，彈性伸縮加壓帶，可同時保護膝蓋及膝蓋肌鍵，護膝加壓帶，保護功效獨特，為美國運動員研發實驗生產。','790','100','54','45','2','98'),
('開放式膝關節護具','protect9.jpg',' 保護支撐中度級膝蓋、保護支撐中度級膝蓋。','590','100','54','45','2','98'),
('X型直套式膝關節加壓帶','protect10.jpg','上下加壓穩定膝蓋提供更佳的支撐、加強支撐髕骨和四頭肌腱。支撐保護因髕骨(膝蓋下側)異位可能導致的軟骨軟化和髕骨股骨(膝蓋下側)疼痛。','1090','100','54','45','2','98'),
('脛骨(小腿)護具加壓帶','protect18.jpg','脛骨(小腿)護具加壓帶，可以對脛骨(小腿)旁邊的肌肉施加輕柔的壓力，有助於防止肌肉的撕裂傷。壓縮不僅可以減少額外的撕裂傷，也可以舒緩疼痛和幫助癒合。此外，使用小腿護具也可以吸收活動時對於小腿的壓力。','990','100','55','45','2','98'),
('緩震小腿襪','protect20.png','內置緩震墊，能有效吸收運動中的衝擊力，減少小腿和腳踝的壓力，提供額外的保護、提供小腿肌肉的支撐，減少運動中的疲勞感和抽筋現象，提升運動表現、 使用透氣和排汗材料，有助於保持小腿乾爽，避免過多出汗引起的不適感。','350','100','55','45','2','98'),
('束小腿','protect21.webp','長程運動、出遊、日常久站久走的好朋友，長時間穿戴也貼合舒適。','2500','100','52','45','2','98'),
('機能壓縮小腿套','protect22.webp','將性能與舒適性完美結合、協助支撐、釋放循環爆發力、材質舒適可機洗，耐久用不易鬆脫、不易滑落專注訓練 發揮最高性能','870','100','55','45','2','98'),
('跑步壓力腿套','protect24.webp','我們的設計團隊開發出這款能提升跑步表現的跑步壓力產品。透過為肌肉加壓提升運動表現。為何要替小腿加壓？可以促進血液循環、減少肌肉震動並改善肢體動作。','870','100','55','45','2','98'),
('冷矽型腳踝關節護具','protect27.jpg','透氣柔軟的特殊材質提供上下左右4個方向的平均拉伸展。厚橢圓形的冷矽墊為髕骨（膝蓋）區域提供優異的舒適性和支撐性。內側和外側的螺旋支撐條提供整體膝關節更佳的穩定性、適合籃球、排球、羽球、網球、高爾夫球、棒球、爬山、慢跑等競技或休閒運動。','790','100','56','45','2','98'),
('3D功能型踝部護具','protect28.jpg','籃球、排球、羽球、網球、高爾夫球、棒球、爬山、慢跑等競技或休閒運動、適用於輕或中度的腳踝扭傷。','790','100','56','45','2','98'),
('十字型阿基里肌腱足部護具','protect29.jpg','十字型阿基里肌腱-足部護具護踝，採用最新的EVA輪廓軟墊，環繞阿基里肌腱，更舒適的穩定性，穿戴時因其透氣、多方向性應力伸展特點，活動靈活，更保持高效支撐保護作用。','990','100','56','45','2','98'),
('伸縮調整式足弓墊一雙','protect30.jpg','採用新型EVA材料成形的足弓支撐墊，提供內側足弓針對性的支撐。此外，足弓墊製作方式使用熱封式黏貼而非縫合，減少足弓墊的厚度，穿在鞋內更佳貼合及舒適','990','100','56','45','2','98'),
('功能型足踝部護具','protect31.jpg','特別的裁縫方式，專門針對腳弓，腳跟和阿基里腱提供更精確的保護穩定性。此外，在足弓和足跟處也特別加強壓縮力以提高支撐性、適用於足底肌膜炎','720','100','56','45','2','98'),
('腳踝部護具','protect32.jpg','保暖熱作用可以幫助韌帶的靈活性,以減少扭傷和撕裂傷的機會，壓縮作用可提供支撐及遏制肌肉發炎、適用於提供踝部保暖和壓縮支撐作用，適用於踝部扭傷。','440','100','56','45','2','98'),
('可調整式踝部護具支撐帶','protect33.jpg','可調整式踝部護具支撐帶,杜邦合成橡膠材質提供保溫和加壓保護的作用，伸縮彈性帶可以隨使用者的情況自行調整緊鬆定。穿鞋子也可使用','790','100','56','45','2','98'),
('一般型護腰帶','protect11.jpg','運動健身機能性護具，減輕腰部壓力，舒緩下背，好品質護腰帶,護腰,束腹帶,健身護腰帶,工作護腰帶，特殊杜邦材料，達到保暖支撐效果，寬版設計，保護更全面','720','100','57','45','2','98'),
('(骶髂關節) 護腰帶','protect12.jpg','S.I.(骶髂關節)護腰帶為臀部和骶骨提供穩定性。S.I.(骶髂關節)護腰帶圍繞臀部比大多數護腰帶更低。壓縮襯墊與第二組外帶結合提供骶骨更有效的支撐保護及壓縮。另外，防滑膠有助於保持骶髂關節護腰帶保持在固定位置。','1190','100','57','45','2','98'),
('彈力護腰帶拉環式','protect13.jpg','適合各種運動/休閒/工作、產後身材恢復/司機/作業員、久坐/久站/銀髮..等','1980','100','57','45','2','98'),
('9吋護腰','protect13.jpg','遠紅外線材質恆定體溫、強力記憶塑條穩定姿勢、雙層網覆繃帶舒適加壓、特殊魔鬼氈好撕黏不易繃開','1380','100','57','45','2','98'),
('石墨烯 黑科技機能護腰帶','protect16.webp','體內水分子活化，改善循環系統，精力更旺盛透氣加壓束帶，2測加壓符合各種身形','2380','100','57','45','2','98');

-- ----------------------------------------------ProductOrders----------------
create table  ProductOrders (
Productorders_orders_id int auto_increment primary key,
ProductOrders_orders_date  timestamp not null default now(),
ProductOrders_m_id_fk int,
ProductOrders_payment_method  varchar(50),
ProductOrders_delivery_method  varchar(50),
ProductOrders_recipient_address    varchar(50), 
ProductOrders_recipient_name varchar(50),
ProductOrders_recipient_phone varchar(50),
foreign key (ProductOrders_m_id_fk) references members(member_id)
);
insert into ProductOrders (ProductOrders_m_id_fk , ProductOrders_payment_method, 
ProductOrders_delivery_method,ProductOrders_recipient_address,ProductOrders_recipient_name,ProductOrders_recipient_phone)
value
( 1,'現金','宅配','台北市信義區','陳美美','0912345678'),
( 2,'刷卡','宅配','台北市松山區','陳可可','0912343678'),
( 3,'刷卡','宅配','台北市新店區','張倩倩','0912342678'),
( 4,'現金','超商取貨','新北市新莊區','李愛愛','0914342678'),
( 5,'現金','超商取貨','新北勢三重區','吳小明','0914342638');

-- ----------------------------OrdersDetail---------------------------------
create table OrdersDetail(
OrdersDetail_id  int auto_increment primary key,
OrdersDetail_product_id_fk   int,
OrdersDetail_product_quantity int,
OrdersDetail_order_id_fk int,
OrdersDetail_unit_price_at_time int
-- foreign key (OrdersDetail_order_id_fk) references ProductOrders(ProductOrders_orders_id),
-- foreign key (OrdersDetail_product_id_fk) references Products(Product_id )


);
SELECT * from products;
use midTermDB;
-- ----------------------------
-- ########################## 文章管理系統 ##########################